--Loop = การทำงานแบบวนซ้ำ
-------------------------------------------------------------------------------------------------------------
--1.For Loop = เป็น loop ที่สามารถกำหนด ค่าเริ่มต้น กับ ค่าสิ้นสุด และ กำหนดได้ว่าจะเพิ่มค่าทีละเท่าไหร่ในแต่ละรอบการทำงาน
for count = 1, 5 do --เริ่มที่ 1 จนถึง 5 เพิ่มค่าทีละ 1  ไม่ใส่ก็ได้เพราะเป็น default
	print(count)
end

--2.While Loop = เป็นที่มีการวนซ้ำไปเรื่อยๆจนกว่าเงื่อนไขจะเป็นเท็จถึงจะหยุดการทำงาน loop
local a = 1    -- ให้ a มีค่าเป็น 1
while a <= 10 do     --เงื่อนจะเป็นเท็จ a ต้องมีค่ามากกว่า 10 
	print("a: " .. a)
	wait(1)
	a = a + 1	        --ให้ a + ตัวเองขึ้นไปทีละ 1
end

--3.Repeat Loop = repeat Loop เหมือนกันกับ while  ทำจนกว่าเงื่อนไขจะเป็นจริง
local a = 1
repeat
	print("a: " .. a)
	a = a + 1
until a > 10
-------------------------------------------------------------------------------------------------------------
